app/controllers/contacts_controller.rb

INSERT INTO `contacts` (`city`, `work_phone`, `job_title`, `zip`, `email_preference`, `company_phone`, `updated_at`, `salutation`, `company_name`, `board_position`, `comments`, `country`, `committee_position`, `gender`, `is_active`, `address_1`, `other_skills`, `address_2`, `home_phone`, `fax`, `pager`, `first_name`, `last_name`, `age`, `state`, `mobile_phone`, `email`, `email_status`, `created_at`) VALUES('', '', '', '', '', '', '2009-11-07 22:40:17', '', '', '', '', 'Australia', '', '', 0, '', '', '', '', '', '', '', '', '', '', '', 'Test', '', '2009-11-07 22:40:17')
---
  def create
    dup = Contact.new(params[:contact]).find_duplicates
    if dup.blank?
      @contact = Contact.new(params[:contact])
      test = @contact.save

SELECT * FROM `contacts` WHERE (`contacts`.`id` = 3)
---
  def thanks
    @contact = Contact.find(params[:id])